operating_system/linux/btrfs.org
* btrfs

** 常用命令

** rockstor

*** 概念与zfs的对比

	Terminology 对比:

     | btrfs             | zfs                      |           |
     |-------------------+--------------------------+-----------|
     | label volume      | pool                     | pool      |
     | subvolume         | dataset                  | share dir |
     | subvolume operate | vdev operate             | resize    |
     | scrub             | scrub                    | scrub     |
     | qgroup            | dataset,user,group quota | quota     |
     |                   |                          | snapshot  |

	
	
**** pool

***** basic 

	  ========
	  
	  btrfs:

	  ========
	  
	  Lable: 卷标, device 加入了同一个卷标, 即认为是同一个pool

	  pool 的状态:  \\
	     MISSING: btrfs fi show --raw , 存在 missing 
		 degrade: 存在 失效 missing 的device的 pool

	  pool 名字:   btrfs fi mount_point 新名字

	  pool 信息获取: btrfs fi show --raw

	  pool 状态: 出现 missing 状态, 即为degrade

	  pool raid: btrfs fi df <mount_point>

	       raid 分 meta 和 data
	  
	  #+begin_src
      $sudo btrfs fi show
      [sudo] password for guo: 
      Label: 'hello1'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
      	Total devices 1 FS bytes used 336.00KiB
       	devid    1 size 350.00MiB used 168.00MiB path /dev/loop0

	  #+end_src

	  ========
	  
      zfs:

	  ========


	  存在pool的概念和工具 utility zpool.
	  
	  pool:  zpool <pool_name> <device>

	  pool的状态:

	    zpool status <null_for_all|pool_name>

		zpool list 

	  pool 会出现degrade 状态: \\
	  state: DEGRADED  \\
	  pool 的降级状态会影响总的状态 \\

	  replace:  zpool replace dev1 dev2 \\
	    执行时, pool中的 device 会出现replacing 状态 \\
	         This is equivalent to \\
             attaching new_device, waiting for it to resilver, and then \\
             detaching old_device.  Any in progress scrub will be cancelled. \\

	  另外:
	  
	    zpool clear, 清除 error message
			 
	  #+begin_src
        # only 显示有问题的pool
        $ zpool status -x
          all pools are healthy


        $ zpool status
          $ zpool status
            pool: zroot
            state: ONLINE
            config:
            
            	NAME        STATE     READ WRITE CKSUM
            	zroot       ONLINE       0     0     0
            	  ada0p4    ONLINE       0     0     0
            	  ada1p4    ONLINE       0     0     0
            
            errors: No known data errors

        $ zpool list
          NAME    SIZE  ALLOC   FREE  CKPOINT  EXPANDSZ   FRAG    CAP  DEDUP    HEALTH  ALTROOT
          zroot  1.02T  32.9G  1011G        -         -     0%     3%  1.00x    ONLINE  -

	  #+end_src

***** mirror

	  ========
	  
	  btrfs:

	  ========


	  data和meta 分开做软raid
	  
	  mkfs.btrfs -d raid1 -m radi1

	  支持: raid0, raid1, raid1c3, raid1c4, raid5, raid6, raid10 or single or dup
	  
	  ========
	  
	  zfs:

	  ========
 	  
	  支持:  mirror, RAID-Z(2+1), RAID-Z2(2+2), RAID-Z3(3+3)


**** resize

***** btrfs vs zfs

	  ========
	  
	  btrfs:

	  ========

	  btrfs <device list> add(default)/delete root_mnt_pt(pool)


	  
	  ========
	  
	  zfs:

	  ========

	  两种方式:
	    - attach disk 到一个已经存在的vdev
		- add vdev 到一个pool
	  
	  zpool attach mypool ada0p3 ada1p3
	  zpool add mypool mirror ada2p3 ada3p3

	  会出现 Resilver
	  
**** scrub

***** btrfs vs zfs

	  ========
	  
	  btrfs:

	  ========

	  检测文件系统错误: btrfs scrub start -B mount_point

	  是否自动修复: 未知?


	  ========
	  
	  zfs:

	  ========

	  检测: Verifying the data checksums

	  zpool scrub <pool_name>

	  执行scrub时, 会进行

	  是否自动修复: 是?


**** import

	 zfs 特有:

	   可以 export 一个非挂载的pool, 然后再 import

	   参考:
	   
	   https://docs.oracle.com/cd/E37934_01/html/E36658/gbchy.html
	  
**** upgrade

	 zfs 特有:
	 
	   升级后

**** history

	 zfs 特有:

	   zpool history, 显示 对 pool 操作的命令

	      -i, -l 显示更多信息

**** mount

	  ========
	  
	  btrfs:

	  ========

	  将 pool root 目录 mount 到default目录(/mnt2), \\
	  例如, test-pool 将被mount到 /mnt2/test-pool

	  由于 btrfs 没有pool的概念, 所谓的pool 是多个磁盘组成的volume, 再设置Label;
	  
	  换句话说: 先有device, 再组成pool;
	  

	  1. 可以根据label mount,  需要先 scan, 再mount;
	  2. 根据device 来mount \\
		 例如: mount -o device=/dev/sdb,device=/dev/sdc,device=/dev/sdd,device=/dev/sde /dev/sdb /data01


	  ========
	  
	  zfs:

	  ========

	  大概不需要;

	  先有 pool, 再加入device;

	  可以使用以下
	   zfs set mountpoint=/home storage/home

	  

**** share

	 ========
	  
	 btrfs:

	 ========
	  
	 share 即 subvolume;

	 一些命令:

	   btrfs subvolume create -i
	 
	   btrfs subvolume list root_pool_mnt


	   
	 ========
	  
	 zfs:

	 ========

	 share 如何对应? 需要讨论下;

	 dataset 可以对应为share 目录

	 zfs list:

	    列出目录

		-H, script 模式, 去除了header

		-s, 各种属性

	 

	  destroy 是个异步的操作: \\
	    可以使用以下命令查看哪些正在后台运行 \\
	    zpool get freeing poolname 
	 
	  支持好多property:
	    zfs get custom:costcenter zroot

***** quota

	  ========
	  
	  btrfs:

	  ========

	  qgroup, 使用qgroup 设置quota

	  qgroup 讲真概念简单, 但逻辑有点复杂, 特别是层次分的有点奇怪, 细节参考官方文档.

	  基本命令:
	    - btrfs show qgroup -reF
		- btrfs qgroup assign qid pqid mount_point

	  ========
	  
	  zfs:

	  ========

	  zfs的quota 逻辑上更好理解一点.
	  
	  支持 dataset 设置quota,

	  zfs set quota=10G storage/home/bob \\
	  zfs set quota=none storage/home/bob

	  支持 user quota

	  zfs set userquota@joe=50G

	  支持 group quota

	  zfs set groupquota@firstgroup=50G

	  支持 Reservations, 为dataset 预留一些空间,  TODO: 跟子dataset 和 snap的关系

	  zfs set reservation=10G storage/home/bob

**** snapshot

	 ========
	  
	 btrfs:

	 ========

	 btrfs subvolume snapshot
	 
	 TODO: 细节待补充

	 ========
	  
	 zfs:

	 ========

	 创建快照, 针对dataset: 
	 
	 zfs snapshot storage/home@08-30-08
	 
	 可用 ls 查看:
	 
	 ls /storage/home/.zfs/snapshot

	  zfs set mountpoint=/home storage/home
	 

	  
*** 其他资料
	
	Fault Management Architecture (FMA) Message Registry
	https://illumos.org/msg/ZFS-8000-4J


	

*** rockstor学习
	学习 rockstor 流水帐记录.
   
**** Pool

	 add pool
	
	 创建pool的主要步骤如下:
	 1. 创建fs
	 2. mount
	 3. 设置quota
	   
