operating_system/linux/btrfs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-11 Mon 20:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="guo" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4dd6c8">1. btrfs</a>
<ul>
<li><a href="#org2cf5938">1.1. 常用命令</a></li>
<li><a href="#org66fa17d">1.2. rockstor</a>
<ul>
<li><a href="#org60405c8">1.2.1. 概念与zfs的对比</a></li>
<li><a href="#org805cefc">1.2.2. 其他资料</a></li>
<li><a href="#org122f6eb">1.2.3. rockstor学习</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga4dd6c8" class="outline-2">
<h2 id="orga4dd6c8"><span class="section-number-2">1.</span> btrfs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2cf5938" class="outline-3">
<h3 id="org2cf5938"><span class="section-number-3">1.1.</span> 常用命令</h3>
</div>

<div id="outline-container-org66fa17d" class="outline-3">
<h3 id="org66fa17d"><span class="section-number-3">1.2.</span> rockstor</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org60405c8" class="outline-4">
<h4 id="org60405c8"><span class="section-number-4">1.2.1.</span> 概念与zfs的对比</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Terminology 对比:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">btrfs</th>
<th scope="col" class="org-left">zfs</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">label volume</td>
<td class="org-left">pool</td>
<td class="org-left">pool</td>
</tr>

<tr>
<td class="org-left">subvolume</td>
<td class="org-left">dataset</td>
<td class="org-left">share dir</td>
</tr>

<tr>
<td class="org-left">subvolume operate</td>
<td class="org-left">vdev operate</td>
<td class="org-left">resize</td>
</tr>

<tr>
<td class="org-left">scrub</td>
<td class="org-left">scrub</td>
<td class="org-left">scrub</td>
</tr>

<tr>
<td class="org-left">qgroup</td>
<td class="org-left">dataset,user,group quota</td>
<td class="org-left">quota</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">snapshot</td>
</tr>
</tbody>
</table>
</div>



<ol class="org-ol">
<li><a id="orgcb36367"></a>pool<br />
<ol class="org-ol">
<li><a id="orge3f671b"></a>basic<br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
Lable: 卷标, device 加入了同一个卷标, 即认为是同一个pool
</p>

<p>
pool 的状态:  <br />
   MISSING: btrfs fi show &#x2013;raw , 存在 missing 
   degrade: 存在 失效 missing 的device的 pool
</p>

<p>
pool 名字:   btrfs fi mount<sub>point</sub> 新名字
</p>

<p>
pool 信息获取: btrfs fi show &#x2013;raw
</p>

<p>
pool 状态: 出现 missing 状态, 即为degrade
</p>

<p>
pool raid: btrfs fi df &lt;mount<sub>point</sub>&gt;
</p>

<p>
raid 分 meta 和 data
</p>

<pre class="example">
$sudo btrfs fi show
[sudo] password for guo: 
Label: 'hello1'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
  Total devices 1 FS bytes used 336.00KiB
  devid    1 size 350.00MiB used 168.00MiB path /dev/loop0

</pre>

<hr />

<p>
zfs:
</p>

<hr />


<p>
存在pool的概念和工具 utility zpool.
</p>

<p>
pool:  zpool &lt;pool<sub>name</sub>&gt; &lt;device&gt;
</p>

<p>
pool的状态:
</p>

<p>
zpool status &lt;null<sub>for</sub><sub>all</sub>|pool<sub>name</sub>&gt;
</p>

<p>
zpool list 
</p>

<p>
pool 会出现degrade 状态: <br />
state: DEGRADED  <br />
pool 的降级状态会影响总的状态 <br />
</p>

<p>
replace:  zpool replace dev1 dev2 <br />
  执行时, pool中的 device 会出现replacing 状态 <br />
	   This is equivalent to <br />
	   attaching new<sub>device</sub>, waiting for it to resilver, and then <br />
	   detaching old<sub>device</sub>.  Any in progress scrub will be cancelled. <br />
</p>

<p>
另外:
</p>

<p>
zpool clear, 清除 error message
</p>

<pre class="example">
# only 显示有问题的pool
$ zpool status -x
  all pools are healthy


$ zpool status
  $ zpool status
	pool: zroot
	state: ONLINE
	config:

		NAME        STATE     READ WRITE CKSUM
		zroot       ONLINE       0     0     0
		  ada0p4    ONLINE       0     0     0
		  ada1p4    ONLINE       0     0     0

	errors: No known data errors

$ zpool list
  NAME    SIZE  ALLOC   FREE  CKPOINT  EXPANDSZ   FRAG    CAP  DEDUP    HEALTH  ALTROOT
  zroot  1.02T  32.9G  1011G        -         -     0%     3%  1.00x    ONLINE  -

</pre>
</div>
</li>

<li><a id="orgbd250ef"></a>mirror<br />
<div class="outline-text-6" id="text-1-2-1-1-2">
<hr />

<p>
btrfs:
</p>

<hr />


<p>
data和meta 分开做软raid
</p>

<p>
mkfs.btrfs -d raid1 -m radi1
</p>

<p>
支持: raid0, raid1, raid1c3, raid1c4, raid5, raid6, raid10 or single or dup
</p>

<hr />

<p>
zfs:
</p>

<hr />

<p>
支持:  mirror, RAID-Z(2+1), RAID-Z2(2+2), RAID-Z3(3+3)
</p>
</div>
</li>
</ol>
</li>


<li><a id="org38d11cd"></a>resize<br />
<ol class="org-ol">
<li><a id="org2e0f2b5"></a>btrfs vs zfs<br />
<div class="outline-text-6" id="text-1-2-1-2-1">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
btrfs &lt;device list&gt; add(default)/delete root<sub>mnt</sub><sub>pt</sub>(pool)
</p>



<hr />

<p>
zfs:
</p>

<hr />

<p>
两种方式:
</p>
<ul class="org-ul">
<li>attach disk 到一个已经存在的vdev</li>
<li>add vdev 到一个pool</li>
</ul>

<p>
zpool attach mypool ada0p3 ada1p3
zpool add mypool mirror ada2p3 ada3p3
</p>

<p>
会出现 Resilver
</p>
</div>
</li>
</ol>
</li>

<li><a id="org092965d"></a>scrub<br />
<ol class="org-ol">
<li><a id="org845d98b"></a>btrfs vs zfs<br />
<div class="outline-text-6" id="text-1-2-1-3-1">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
检测文件系统错误: btrfs scrub start -B mount<sub>point</sub>
</p>

<p>
是否自动修复: 未知?
</p>


<hr />

<p>
zfs:
</p>

<hr />

<p>
检测: Verifying the data checksums
</p>

<p>
zpool scrub &lt;pool<sub>name</sub>&gt;
</p>

<p>
执行scrub时, 会进行
</p>

<p>
是否自动修复: 是?
</p>
</div>
</li>
</ol>
</li>


<li><a id="org0438de5"></a>import<br />
<div class="outline-text-5" id="text-1-2-1-4">
<p>
zfs 特有:
</p>

<p>
可以 export 一个非挂载的pool, 然后再 import
</p>

<p>
参考:
</p>

<p>
<a href="https://docs.oracle.com/cd/E37934_01/html/E36658/gbchy.html">https://docs.oracle.com/cd/E37934_01/html/E36658/gbchy.html</a>
</p>
</div>
</li>

<li><a id="org324914a"></a>upgrade<br />
<div class="outline-text-5" id="text-1-2-1-5">
<p>
zfs 特有:
</p>

<p>
升级后
</p>
</div>
</li>

<li><a id="org03965b0"></a>history<br />
<div class="outline-text-5" id="text-1-2-1-6">
<p>
zfs 特有:
</p>

<p>
zpool history, 显示 对 pool 操作的命令
</p>

<p>
-i, -l 显示更多信息
</p>
</div>
</li>

<li><a id="org994c2a9"></a>mount<br />
<div class="outline-text-5" id="text-1-2-1-7">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
将 pool root 目录 mount 到default目录(/mnt2), <br />
例如, test-pool 将被mount到 /mnt2/test-pool
</p>

<p>
由于 btrfs 没有pool的概念, 所谓的pool 是多个磁盘组成的volume, 再设置Label;
</p>

<p>
换句话说: 先有device, 再组成pool;
</p>


<ol class="org-ol">
<li>可以根据label mount,  需要先 scan, 再mount;</li>
<li>根据device 来mount <br />
例如: mount -o device=/dev/sdb,device=/dev/sdc,device=/dev/sdd,device=/dev/sde /dev/sdb /data01</li>
</ol>


<hr />

<p>
zfs:
</p>

<hr />

<p>
大概不需要;
</p>

<p>
先有 pool, 再加入device;
</p>

<p>
可以使用以下
 zfs set mountpoint=/home storage/home
</p>
</div>
</li>



<li><a id="org53ecd1e"></a>share<br />
<div class="outline-text-5" id="text-1-2-1-8">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
share 即 subvolume;
</p>

<p>
一些命令:
</p>

<p>
btrfs subvolume create -i
</p>

<p>
btrfs subvolume list root<sub>pool</sub><sub>mnt</sub>
</p>



<hr />

<p>
zfs:
</p>

<hr />

<p>
share 如何对应? 需要讨论下;
</p>

<p>
dataset 可以对应为share 目录
</p>

<p>
zfs list:
</p>

<p>
列出目录
</p>

<p>
-H, script 模式, 去除了header
</p>

<p>
-s, 各种属性
</p>



<p>
destroy 是个异步的操作: <br />
  可以使用以下命令查看哪些正在后台运行 <br />
  zpool get freeing poolname 
</p>

<p>
支持好多property:
  zfs get custom:costcenter zroot
</p>
</div>

<ol class="org-ol">
<li><a id="orgd486f48"></a>quota<br />
<div class="outline-text-6" id="text-1-2-1-8-1">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
qgroup, 使用qgroup 设置quota
</p>

<p>
qgroup 讲真概念简单, 但逻辑有点复杂, 特别是层次分的有点奇怪, 细节参考官方文档.
</p>

<p>
基本命令:
</p>
<ul class="org-ul">
<li>btrfs show qgroup -reF</li>
<li>btrfs qgroup assign qid pqid mount<sub>point</sub></li>
</ul>

<hr />

<p>
zfs:
</p>

<hr />

<p>
zfs的quota 逻辑上更好理解一点.
</p>

<p>
支持 dataset 设置quota,
</p>

<p>
zfs set quota=10G storage/home/bob <br />
zfs set quota=none storage/home/bob
</p>

<p>
支持 user quota
</p>

<p>
zfs set userquota@joe=50G
</p>

<p>
支持 group quota
</p>

<p>
zfs set groupquota@firstgroup=50G
</p>

<p>
支持 Reservations, 为dataset 预留一些空间,  TODO: 跟子dataset 和 snap的关系
</p>

<p>
zfs set reservation=10G storage/home/bob
</p>
</div>
</li>
</ol>
</li>

<li><a id="org4071792"></a>snapshot<br />
<div class="outline-text-5" id="text-1-2-1-9">
<hr />

<p>
btrfs:
</p>

<hr />

<p>
btrfs subvolume snapshot
</p>

<p>
TODO: 细节待补充
</p>

<hr />

<p>
zfs:
</p>

<hr />

<p>
创建快照, 针对dataset: 
</p>

<p>
zfs snapshot storage/home@08-30-08
</p>

<p>
可用 ls 查看:
</p>

<p>
ls <i>storage/home</i>.zfs/snapshot
</p>

<p>
zfs set mountpoint=/home storage/home
</p>
</div>
</li>
</ol>
</div>



<div id="outline-container-org805cefc" class="outline-4">
<h4 id="org805cefc"><span class="section-number-4">1.2.2.</span> 其他资料</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Fault Management Architecture (FMA) Message Registry
<a href="https://illumos.org/msg/ZFS-8000-4J">https://illumos.org/msg/ZFS-8000-4J</a>
</p>
</div>
</div>




<div id="outline-container-org122f6eb" class="outline-4">
<h4 id="org122f6eb"><span class="section-number-4">1.2.3.</span> rockstor学习</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
学习 rockstor 流水帐记录.
</p>
</div>

<ol class="org-ol">
