operating_system/linux/btrfs.org
***** 创建fs

	  fun: add_pool

	  in: pool, disks
	  
	  cmd: mkfs.btrfs -f -d draid -m mraid -L name xpathx  

		-L   lable (pool) \\
		-m   matedata profile (raid0, raid1, raid1c3, raid1c4, raid5, raid6 raid10, dup, single)  \\
		-d   data profile  \\
		-f   force overwrite \\ 
		path /dev/disk/by-id/{} \\   

	   
***** 设置quota
	 
		 btrfs device scan
		
		 mount,
				默认在 /mnt2/lablename, -o options  \\
				root的话, 参数options增加: subvol=/@  \\
				compress=request的传参 ('lzo', 'zlib', 'no',)  
			   
		 先根据 label mount, 失败后再根据 device

	     btrfs quota enable mountpoint

****** quota enable 

	  enable_quota, disable_quote 包装了 switch_quota, 提供配额的 开启/关闭 功能
	 
******* switch_quota	 
	  fun: switch_quota

	  in: pool, flag=enable

	  cmd: btrfs quota flag pool_mount_point

****** rescan quota

	   fun: recas_quotas

	   in: pool

	   cmd: btrfs quota rescan pool_mount_point

****** quota is enable

	   fun: are_quotas_enable

	   in: mount_point

	   cmd: btrfs qgroup show -f --raw mount_point

	   返回0 并且 标准错误 是空或者 报warning:建议 rescan,  返回 true
	   其他场合返回 false

****** qgroup id

	   fun: qgroup_id

	   in: pool, share_name
	  
	   return: 0/sid



****** qgroup max

	   fun: qgroup_max

	   in: mount_point

	   cmd: btrfs qgroup show mnt_point

	   返回最大层数?

	   2015 不清楚是最大层数吗? 为什么要么是0, 要么是2015?
	   理论上可以分很多层, 是不是为了方便管理,  rockstor 只分了两层

****** qgroup create

	   fun: qgroup_create,  创建share 目录时调用

	   in: pool

****** qgroup destroy

	   fun: qgroup_destroy

	   in: qid, mount_point

****** quroup as assigned

	   fun: qgroup_is_assigned

	   in: qid, pqid, mount_point

	   cmd: btrfs qgroup show -pc mount_point
	  
****** qgroup assign

	   fun: qgroup_assign

	   in: qid, pqid, mount_point

	   cmd: btrfs qgroup assign qid pqid mount_point

****** update quota

	   fun: update_quota

	   in: pool, qgroup, size_bytes

	   cmd: btrfs qgroup limit none qgroup pool_mount_point

	   注: 没有使用size, 这个设置真的会起作用?
	  
**** 获取设备 stats

	 fun: dev_stats_zero, get_dev_io_error_stats
	
	  btrfs device stats -c moutpoint

	  - 返回 64(2#1000000) 说明有问题
	  - 返回 0 正常
	  - 返回 1 dev 不是 btrfs, ERROR: not a btrfs filesystem
	   

***** 模拟 io error

	   dd  if=/dev/zero of=btrfs-loop bs=1M count=350
	  
	   sudo mkfs.btrfs btrfs-loop
	  
	   sudo mount -o loop btrfs-loop /mnt/btrfs/
	  
	   sudo touch /mnt/btrfs/test.txt
	  
	   for (( i=0;i<10000;i++ )) ;do sudo echo "string" >> /mnt/btrfs/test.txt ;done
	  
	   echo "localuseabcdefg" >> /mnt/btrfs/test.txt
	  
	   sudo umount /mnt/btrfs
	  
	   sudo hexedit btrfs-loop
	  
	   sudo mount -o loop btrfs-loop /mnt/btrfs/
	  
	   sudo cp /mnt/btrfs/test.txt /mnt/btrfs/test1.txt

	   #+begin_src
         [/dev/loop0].write_io_errs    0
         [/dev/loop0].read_io_errs     0
         [/dev/loop0].flush_io_errs    0
         [/dev/loop0].corruption_errs  3
         [/dev/loop0].generation_errs  0
	   #+end_src


***** 获取 volume 使用率

	  新的方式获取使用率
	 
	  fun: volume_usage

	  in: pool, volume_id(0/*), pvolume_id=None(2015/*)

	  cmd:

	   1. btrfs subvolume list pool_mount_point
	   2. btrfs qgroup show volume_dir

	  回到了 ref size 和 exclued size, 由于 2015/* 两个size经常是相等的, 使用哪个都一样?


***** 共享目录的使用率

	  fun: share_usage

	  in: pool, share_map, snap_map

	  cmd: btrfs qgroup show mount_point
	 
	  return: usage_map

***** pool 使用率

	  fun: pool_usage

	  in: mount_point

	  cmd: btrfs fi usage -b mount_point
	 
	  return:  used / 1024

	  #+begin_src
		Overall:
			Device size:		         367001600
			Device allocated:		          92274688
			Device unallocated:		         274726912
			Device missing:		                 0
			Used:			            524288
			Free (estimated):		         282951680	(min: 145588224)
			Free (statfs, df):		         281903104
			Data ratio:			              1.00
			Metadata ratio:		              2.00
			Global reserve:		           3407872	(used: 0)
			Multiple profiles:		                no
       
		Data,single: Size:8388608, Used:163840 (1.95%)
           /dev/loop0	   8388608
       
		Metadata,DUP: Size:33554432, Used:163840 (0.49%)
           /dev/loop0	  67108864
       
		System,DUP: Size:8388608, Used:16384 (0.20%)
           /dev/loop0	  16777216
       
		Unallocated:
           /dev/loop0	 274726912
       
	  #+end_src

***** usage_bound

	  fun: usage_bound

	  in: disk_size, num_devices, raid_level

	  return: bytes

	  递归调用, 没看懂?
	  主要是跟raid 有关, 获取实际使用率

***** device usage

	  fun: get_devid_usage

	  in: mount_point

	  cmd: btrfs device usage -b mount_point

	  #+begin_src
       $ sudo btrfs device usage -b ./
       /dev/loop0, ID: 1
          Device size:           367001600
          Device slack:                  0
          Data,single:             8388608
          Metadata,DUP:          100663296
          System,DUP:             67108864
          Unallocated:           190840832

	  #+end_src
	 
	 
**** file system missing

	 fun: is_pool_missing_dev
	
	 btrfs fi show --raw label

	 false, device is missing from de given pool

	 有一个device missing, 即为false
	
	 #+begin_src
       Label: none  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
	   Total devices 1 FS bytes used 282624
	   devid    1 size 367001600 used 92274688 path /dev/loop0

	 #+end_src

**** degrade

	 fun: degraded_pools_found
	
	 btrfs fi show --raw label

	 返回 Label, 正常
	 返回 missing, 降级 count + 1
   
**** set label

	 fun: set_pool_label
	
	 btrfs fi label dev|mnt_pt

	 主要是自动设置 label, 因为初始化有些是none

	 root 通过 setting.SYS_VOL_LABEL设置

	 #+begin_src
     sudo btrfs filesystem label /mnt/btrfs/  hello
     sudo btrfs filesystem show
     Label: 'hello'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
	 Total devices 1 FS bytes used 276.00KiB
	 devid    1 size 350.00MiB used 88.00MiB path /dev/loop0

	 #+end_src

***** dev mount point

	  fun: dev_mount_point
	 
	  参数 device name /dev/sda
	 
	  通过 /proc/mounts 匹配, 获取第一个匹配的 mount point

	  None 说明没有匹配到

**** 获取所有 pool info

	 fun: get_dev_pool_info

	 btrfs fi show --raw

	 return: {DevPoolInfo}
	 DevPoolInfo, nametuple,
		("DevPoolInfo", "devid size allocated uuid label")

