operating_system/linux/btrfs.html
<li><a id="org277f086"></a>Pool<br />
<div class="outline-text-5" id="text-1-2-3-1">
<p>
add pool
</p>

<p>
创建pool的主要步骤如下:
</p>
<ol class="org-ol">
<li>创建fs</li>
<li>mount</li>
<li>设置quota</li>
</ol>
</div>

<ol class="org-ol">
<li><a id="org07422de"></a>创建fs<br />
<div class="outline-text-6" id="text-1-2-3-1-1">
<p>
fun: add<sub>pool</sub>
</p>

<p>
in: pool, disks
</p>

<p>
cmd: mkfs.btrfs -f -d draid -m mraid -L name xpathx  
</p>

<p>
-L   lable (pool) <br />
-m   matedata profile (raid0, raid1, raid1c3, raid1c4, raid5, raid6 raid10, dup, single)  <br />
-d   data profile  <br />
-f   force overwrite <br />
path /dev/disk/by-id/{} <br />
</p>
</div>
</li>


<li><a id="orgecce5f9"></a>设置quota<br />
<div class="outline-text-6" id="text-1-2-3-1-2">
<p>
btrfs device scan
</p>

<p>
mount,
	   默认在 /mnt2/lablename, -o options  <br />
	   root的话, 参数options增加: subvol=/@  <br />
	   compress=request的传参 ('lzo', 'zlib', 'no',)  
</p>

<p>
先根据 label mount, 失败后再根据 device
</p>

<p>
btrfs quota enable mountpoint
</p>
</div>

<ol class="org-ol">
<li><a id="org2da18fc"></a>quota enable<br />
<div class="outline-text-7" id="text-1-2-3-1-2-1">
<p>
enable<sub>quota</sub>, disable<sub>quote</sub> 包装了 switch<sub>quota</sub>, 提供配额的 开启/关闭 功能
</p>
</div>

<ol class="org-ol">
<li><a id="orgee8cb3a"></a>switch<sub>quota</sub><br />
<div class="outline-text-8" id="text-1-2-3-1-2-1-1">
<p>
fun: switch<sub>quota</sub>
</p>

<p>
in: pool, flag=enable
</p>

<p>
cmd: btrfs quota flag pool<sub>mount</sub><sub>point</sub>
</p>
</div>
</li>
</ol>
</li>

<li><a id="org90f3af3"></a>rescan quota<br />
<div class="outline-text-7" id="text-1-2-3-1-2-2">
<p>
fun: recas<sub>quotas</sub>
</p>

<p>
in: pool
</p>

<p>
cmd: btrfs quota rescan pool<sub>mount</sub><sub>point</sub>
</p>
</div>
</li>

<li><a id="orgbe5cf4a"></a>quota is enable<br />
<div class="outline-text-7" id="text-1-2-3-1-2-3">
<p>
fun: are<sub>quotas</sub><sub>enable</sub>
</p>

<p>
in: mount<sub>point</sub>
</p>

<p>
cmd: btrfs qgroup show -f &#x2013;raw mount<sub>point</sub>
</p>

<p>
返回0 并且 标准错误 是空或者 报warning:建议 rescan,  返回 true
其他场合返回 false
</p>
</div>
</li>

<li><a id="org9ad4dc7"></a>qgroup id<br />
<div class="outline-text-7" id="text-1-2-3-1-2-4">
<p>
fun: qgroup<sub>id</sub>
</p>

<p>
in: pool, share<sub>name</sub>
</p>

<p>
return: 0/sid
</p>
</div>
</li>



<li><a id="orgc201b00"></a>qgroup max<br />
<div class="outline-text-7" id="text-1-2-3-1-2-5">
<p>
fun: qgroup<sub>max</sub>
</p>

<p>
in: mount<sub>point</sub>
</p>

<p>
cmd: btrfs qgroup show mnt<sub>point</sub>
</p>

<p>
返回最大层数?
</p>

<p>
2015 不清楚是最大层数吗? 为什么要么是0, 要么是2015?
理论上可以分很多层, 是不是为了方便管理,  rockstor 只分了两层
</p>
</div>
</li>

<li><a id="org117f08e"></a>qgroup create<br />
<div class="outline-text-7" id="text-1-2-3-1-2-6">
<p>
fun: qgroup<sub>create</sub>,  创建share 目录时调用
</p>

<p>
in: pool
</p>
</div>
</li>

<li><a id="org0f6d097"></a>qgroup destroy<br />
<div class="outline-text-7" id="text-1-2-3-1-2-7">
<p>
fun: qgroup<sub>destroy</sub>
</p>

<p>
in: qid, mount<sub>point</sub>
</p>
</div>
</li>

<li><a id="org85dcbdf"></a>quroup as assigned<br />
<div class="outline-text-7" id="text-1-2-3-1-2-8">
<p>
fun: qgroup<sub>is</sub><sub>assigned</sub>
</p>

<p>
in: qid, pqid, mount<sub>point</sub>
</p>

<p>
cmd: btrfs qgroup show -pc mount<sub>point</sub>
</p>
</div>
</li>

<li><a id="org5639b28"></a>qgroup assign<br />
<div class="outline-text-7" id="text-1-2-3-1-2-9">
<p>
fun: qgroup<sub>assign</sub>
</p>

<p>
in: qid, pqid, mount<sub>point</sub>
</p>

<p>
cmd: btrfs qgroup assign qid pqid mount<sub>point</sub>
</p>
</div>
</li>

<li><a id="org03db297"></a>update quota<br />
<div class="outline-text-7" id="text-1-2-3-1-2-10">
<p>
fun: update<sub>quota</sub>
</p>

<p>
in: pool, qgroup, size<sub>bytes</sub>
</p>

<p>
cmd: btrfs qgroup limit none qgroup pool<sub>mount</sub><sub>point</sub>
</p>

<p>
注: 没有使用size, 这个设置真的会起作用?
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orgb8532bf"></a>获取设备 stats<br />
<div class="outline-text-5" id="text-1-2-3-2">
<p>
fun: dev<sub>stats</sub><sub>zero</sub>, get<sub>dev</sub><sub>io</sub><sub>error</sub><sub>stats</sub>
</p>

<p>
btrfs device stats -c moutpoint
</p>

<ul class="org-ul">
<li>返回 64(2#1000000) 说明有问题</li>
<li>返回 0 正常</li>
<li>返回 1 dev 不是 btrfs, ERROR: not a btrfs filesystem</li>
</ul>
</div>


<ol class="org-ol">
<li><a id="org3fa822e"></a>模拟 io error<br />
<div class="outline-text-6" id="text-1-2-3-2-1">
<p>
dd  if=/dev/zero of=btrfs-loop bs=1M count=350
</p>

<p>
sudo mkfs.btrfs btrfs-loop
</p>

<p>
sudo mount -o loop btrfs-loop <i>mnt/btrfs</i>
</p>

<p>
sudo touch /mnt/btrfs/test.txt
</p>

<p>
for (( i=0;i&lt;10000;i++ )) ;do sudo echo "string" &gt;&gt; /mnt/btrfs/test.txt ;done
</p>

<p>
echo "localuseabcdefg" &gt;&gt; /mnt/btrfs/test.txt
</p>

<p>
sudo umount /mnt/btrfs
</p>

<p>
sudo hexedit btrfs-loop
</p>

<p>
sudo mount -o loop btrfs-loop <i>mnt/btrfs</i>
</p>

<p>
sudo cp /mnt/btrfs/test.txt /mnt/btrfs/test1.txt
</p>

<pre class="example">
[/dev/loop0].write_io_errs    0
[/dev/loop0].read_io_errs     0
[/dev/loop0].flush_io_errs    0
[/dev/loop0].corruption_errs  3
[/dev/loop0].generation_errs  0
</pre>
</div>
</li>


<li><a id="org6cd040f"></a>获取 volume 使用率<br />
<div class="outline-text-6" id="text-1-2-3-2-2">
<p>
新的方式获取使用率
</p>

<p>
fun: volume<sub>usage</sub>
</p>

<p>
in: pool, volume<sub>id</sub>(0/*), pvolume<sub>id</sub>=None(2015/*)
</p>

<p>
cmd:
</p>

<ol class="org-ol">
<li>btrfs subvolume list pool<sub>mount</sub><sub>point</sub></li>
<li>btrfs qgroup show volume<sub>dir</sub></li>
</ol>

<p>
回到了 ref size 和 exclued size, 由于 2015/* 两个size经常是相等的, 使用哪个都一样?
</p>
</div>
</li>


<li><a id="org12c3767"></a>共享目录的使用率<br />
<div class="outline-text-6" id="text-1-2-3-2-3">
<p>
fun: share<sub>usage</sub>
</p>

<p>
in: pool, share<sub>map</sub>, snap<sub>map</sub>
</p>

<p>
cmd: btrfs qgroup show mount<sub>point</sub>
</p>

<p>
return: usage<sub>map</sub>
</p>
</div>
</li>

<li><a id="org0873e45"></a>pool 使用率<br />
<div class="outline-text-6" id="text-1-2-3-2-4">
<p>
fun: pool<sub>usage</sub>
</p>

<p>
in: mount<sub>point</sub>
</p>

<p>
cmd: btrfs fi usage -b mount<sub>point</sub>
</p>

<p>
return:  used / 1024
</p>

<pre class="example">
Overall:
	Device size:		         367001600
	Device allocated:		          92274688
	Device unallocated:		         274726912
	Device missing:		                 0
	Used:			            524288
	Free (estimated):		         282951680	(min: 145588224)
	Free (statfs, df):		         281903104
	Data ratio:			              1.00
	Metadata ratio:		              2.00
	Global reserve:		           3407872	(used: 0)
	Multiple profiles:		                no

Data,single: Size:8388608, Used:163840 (1.95%)
   /dev/loop0	   8388608

Metadata,DUP: Size:33554432, Used:163840 (0.49%)
   /dev/loop0	  67108864

System,DUP: Size:8388608, Used:16384 (0.20%)
   /dev/loop0	  16777216

Unallocated:
   /dev/loop0	 274726912

</pre>
</div>
</li>

<li><a id="org513e455"></a>usage<sub>bound</sub><br />
<div class="outline-text-6" id="text-1-2-3-2-5">
<p>
fun: usage<sub>bound</sub>
</p>

<p>
in: disk<sub>size</sub>, num<sub>devices</sub>, raid<sub>level</sub>
</p>

<p>
return: bytes
</p>

<p>
递归调用, 没看懂?
主要是跟raid 有关, 获取实际使用率
</p>
</div>
</li>

<li><a id="orgee62bf8"></a>device usage<br />
<div class="outline-text-6" id="text-1-2-3-2-6">
<p>
fun: get<sub>devid</sub><sub>usage</sub>
</p>

<p>
in: mount<sub>point</sub>
</p>

<p>
cmd: btrfs device usage -b mount<sub>point</sub>
</p>

<pre class="example">
$ sudo btrfs device usage -b ./
/dev/loop0, ID: 1
   Device size:           367001600
   Device slack:                  0
   Data,single:             8388608
   Metadata,DUP:          100663296
   System,DUP:             67108864
   Unallocated:           190840832

</pre>
</div>
</li>
</ol>
</li>


<li><a id="org344daac"></a>file system missing<br />
<div class="outline-text-5" id="text-1-2-3-3">
<p>
fun: is<sub>pool</sub><sub>missing</sub><sub>dev</sub>
</p>

<p>
btrfs fi show &#x2013;raw label
</p>

<p>
false, device is missing from de given pool
</p>

<p>
有一个device missing, 即为false
</p>

<pre class="example">
Label: none  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
Total devices 1 FS bytes used 282624
devid    1 size 367001600 used 92274688 path /dev/loop0

</pre>
</div>
</li>

<li><a id="org40626b8"></a>degrade<br />
<div class="outline-text-5" id="text-1-2-3-4">
<p>
fun: degraded<sub>pools</sub><sub>found</sub>
</p>

<p>
btrfs fi show &#x2013;raw label
</p>

<p>
返回 Label, 正常
返回 missing, 降级 count + 1
</p>
</div>
</li>

<li><a id="orgd9cbe02"></a>set label<br />
<div class="outline-text-5" id="text-1-2-3-5">
<p>
fun: set<sub>pool</sub><sub>label</sub>
</p>

<p>
btrfs fi label dev|mnt<sub>pt</sub>
</p>

<p>
主要是自动设置 label, 因为初始化有些是none
</p>

<p>
root 通过 setting.SYS<sub>VOL</sub><sub>LABEL设置</sub>
</p>

<pre class="example">
sudo btrfs filesystem label /mnt/btrfs/  hello
sudo btrfs filesystem show
Label: 'hello'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
Total devices 1 FS bytes used 276.00KiB
devid    1 size 350.00MiB used 88.00MiB path /dev/loop0

</pre>
</div>

<ol class="org-ol">
<li><a id="org24b9f64"></a>dev mount point<br />
<div class="outline-text-6" id="text-1-2-3-5-1">
<p>
fun: dev<sub>mount</sub><sub>point</sub>
</p>

<p>
参数 device name /dev/sda
</p>

<p>
通过 /proc/mounts 匹配, 获取第一个匹配的 mount point
</p>

<p>
None 说明没有匹配到
</p>
</div>
</li>
</ol>
</li>

<li><a id="org64ac3e2"></a>获取所有 pool info<br />
<div class="outline-text-5" id="text-1-2-3-6">
<p>
fun: get<sub>dev</sub><sub>pool</sub><sub>info</sub>
</p>

<p>
btrfs fi show &#x2013;raw
</p>

<p>
return: {DevPoolInfo}
DevPoolInfo, nametuple,
   ("DevPoolInfo", "devid size allocated uuid label")
</p>
</div>
</li>
