operating_system/linux/btrfs.org
**** 获取 pool info

	 fun: get_pool_info

	 btrfs fi show --raw path(/dev/disk/by-id)

	 #+begin_src
	 pool_info = {
         "disks": {},
         "hasMissingDev": False,
         "fullDevCount": 0,
         "missingDevCount": 0,
     }
	 #+end_src

	 Dev , namedtuple , ("Dev", "temp_name is_byid devid size allocated")

**** 获取 pool raid

	 fun: pool_raid

	 btrfs fi df mountpoint

	 #+begin_src
     Data, single: total=8.00MiB, used=148.00KiB
     System, DUP: total=8.00MiB, used=16.00KiB
     Metadata, DUP: total=32.00MiB, used=112.00KiB
     GlobalReserve, single: total=3.25MiB, used=0.00B
	 #+end_src

	 ?含义

**** 获取 dev list

	 fun: cur_devices
	
	 in: mount point

	 cmd: 	btrfs fi show mountpoint

	 #+begin_src
     Label: 'hello'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
	 Total devices 1 FS bytes used 276.00KiB
	 devid    1 size 350.00MiB used 88.00MiB path /dev/loop0
	 #+end_src


	 return: /dev/loop0

**** resize

	 fun: resize_pool_cmd

	 in: pool, dev_list_byid, add=True

	 return: cmd, btrfs <device list> add(defauld)/delete root_mnt_pt(pool)

	 cmd: btrfs device add <dev-list>

	 /dev/disk/by-id/{id}

	 detached- 开头的dev, 说明有missing

**** 挂载pool

	 fun: mount_root

	 in: pool

	 return: mount point

	 默认挂载路径, /mnt2/
	
	 pool.mnt_opiton 将会加入到mount 命令中的 -o 选项中, 包括 compress
	
	 存在两个 mount 变量, 当 default_subvol().boot_to_snap
		- True, subvol=/@
		- False,

	 先根据 /dev/disk/by-label/pool.name 进行mount 操作,
	 失败后 根据/dev/disk/by-id/pool.disk_set.all() 进行, 

	 主要过程:
	  1. 创建mount point dir
	  2. 更改rw属性, chattr +i
	  3. 获取dev by label, /dev/disk/by-label/{}
	  4. mount dev dir
	  5. 增加opiton
	  6. dev scan
	  7. 不能根据 label mount 时, 根据device id mount
	
**** 卸载 mount point

	 fun: umount_root
	
	 in: mountpoint

	 cmd: umount -l mountpoint

	 -l, lazy unmount

	 获取mount状态(/proc/mount) 20 次(间隔 2秒),
	 当没有mount时, 更改rw属性为可读写, 删除dir

**** 判定 subvolume  状态

	 fun: is_subvol

	 in: mountpoint

	 cmd: btrfs subvolume show mnt_pt

	 cmd 结果 0, 返回True
	
	 return: True|False

	 true: 该 mount point 存在 subvolumn

	 #+begin_src
	
     /
    	 Name: 			<FS_TREE>
    	 UUID: 			07c27a72-f091-4481-9830-0334eb5b3ab4
    	 Parent UUID: 		-
    	 Received UUID: 		-
    	 Creation time: 		2022-07-07 19:19:51 +0800
    	 Subvolume ID: 		5
    	 Generation: 		19
    	 Gen at creation: 	0
    	 Parent ID: 		0
    	 Top level ID: 		0
    	 Flags: 			-
    	 Snapshot(s):
    
	 #+end_src

**** 获取 subvolume 信息

	 fun: subvol_info

	 in: mountpoint
	
	 cmd: btrfs subvolume show mountpoint

**** 增加share 目录

	 share 即 subvolume

	 fun: add_share

	 in: pool, sharename, qid
	
	 cmd: btrfs subvolume create -i 
	
	 share moutponint: /root_mount_point/sharename

	 qid: 子卷配额组, qgroup_create, \\
		default, -1/-1 , 返回非-1/-1, 说明quota enabled \\
		highest quota 2015/n

	 #+BEGIN_src
      sudo btrfs qgroup show /mnt/btrfs/
      qgroupid         rfer         excl 
      --------         ----         ---- 
      0/5         164.00KiB    164.00KiB 
     
	 #+end_src

	
	 qgroupid: level/id
	
	   level 0 is reserved to the qgroups associated with subvolumes.

	   0/5 是 root subvolumn
	  

	 btrfs show qgroup
	     exclusively (excl)
	     shared/referred to (rfer)

	 btrfs qgroup show -reF ./a
	 sudo  btrfs qgroup show -p ./a
	
	 exclusive:
	   Exclusive of a qgroup conveys the useful information
	   how much space will be freed in case all subvolumes of the qgroup get deleted


	 注:
	 https://btrfs.readthedocs.io/en/latest/btrfs-qgroup.html
	 Qgroup is not stable yet and will impact performance in current
	 mainline kernel (v4.14).

**** 挂载共享目录

	 fun: mount_share
	 in: share, monut point
	 cmd: mount -t btrfs -o subvol_str(subvolid=qgroup[2:]), pooldevice , mountpoint


	 fun: mount_snap
	 in: share, snap_name, snap_qgroup, snap_mnt
	 cmd: mount -t btrfs -o subvol_str(subvolid=qgroup[2:]), pooldevice , mountpoint

**** 默认 subvol

	
	 cmd: btrfs subvol get-default /mnt/btrfs

	 由于 snapshot 和 rollback 后的qgroup, 还有subvol id 如何设置, 需要后面补充?

**** snapshot id

	 cmd: btrfs subvol list -s pool_mount_point


**** share info
	
	 cmd:
	   btrfs subvol list -s mnt_point,  snapshot id
	   btrfs subvol list -p mnt_point,  parent id

	   '/@',  snap vol ?

***** share id

	  fun: share_id

	  in: pool, sharename

	  cmd: btrfs subvolume list root_pool_mnt

***** remove_share

	  fun: remove_share

	  in: pool, sharename, pgroup, force=false

	  cmd: \\
		1. umount -l mountpoint,  (fun: umount_root)
		2. btrfs subvol list -o subvol_mountpoint
		3. btrfs subvol delete subvol, 删除下面的 子volume
		4. btrfs subvol delete subvol, 删除该mount point的volume
		5. btrfs qgroup show mountpoint (fun: qgroup_destroy), 查找 qgroup
		6. btrfs qgroup destroy qid mountpoint, 删除 qgroup

		  
***** qgroup_destroy

	  fun: qgroup_destroy

	  in: gid, mount_point

	  cmd:
	     - 查找 btrfs qgroup show moutpoint
		 - 删除 btrfs qgroup destroy qid mountpoint
	 
**** snap
	
***** 获取 snap 详细信息	

	  fun: parse_snap_details

	  in: pool mount point, snap path

	  return:
		- snapshot name or None , if snap is clone
		- writable
		- is_clone

***** 获取 snap 信息

	  fun: snaps_info
	  cmd: btrfs subvolume list -u -p -q mountpoint
	  return: snap dict

	  #+begin_src

       sudo btrfs subvol list -u -p -q .
       ID 256 gen 42 parent 5 top level 5 parent_uuid -
           uuid a9d20f4c-555b-d746-92d0-21280852e009 path a
       ID 257 gen 42 parent 5 top level 5 parent_uuid -
           uuid 41fe9e5f-c0dd-9941-875e-3d60fd880ef0 path b


	  #+end_src

	 
	  
***** 获取 property

	  fun: get_property

	  in:  mount point, property name

	  cmd: btrfs property get mnt_pt prop_name 

	  mount point: Vol(pool)/subvol(share/snap)

	  suppont property :
		- ro
		- compression
		- label

	#+begin_src
	 $ btrfs property get  .
		ro=false
		label=hello
	#+end_src


***** 获取 snap

	  fun: get_snap, \\
	       get_oldest_snap, get_lastest_snap 是上面函数的包装
	 

	  in: subvol path, oldest, num_retain, regex , test_model

	  cmd: btrfs subvol list -o subvol_path

	       -o 获取指定目录的 subvolumes,  但可能会被deprecated
		   参考:
		   https://www.mail-archive.com/linux-btrfs@vger.kernel.org/msg75514.html


