operating_system/linux/btrfs.html

<li><a id="org1d09ace"></a>获取 pool info<br />
<div class="outline-text-5" id="text-1-2-3-7">
<p>
fun: get<sub>pool</sub><sub>info</sub>
</p>

<p>
btrfs fi show &#x2013;raw path(/dev/disk/by-id)
</p>

<pre class="example">
pool_info = {
	"disks": {},
	"hasMissingDev": False,
	"fullDevCount": 0,
	"missingDevCount": 0,
}
</pre>

<p>
Dev , namedtuple , ("Dev", "temp<sub>name</sub> is<sub>byid</sub> devid size allocated")
</p>
</div>
</li>

<li><a id="org31bca13"></a>获取 pool raid<br />
<div class="outline-text-5" id="text-1-2-3-8">
<p>
fun: pool<sub>raid</sub>
</p>

<p>
btrfs fi df mountpoint
</p>

<pre class="example">
Data, single: total=8.00MiB, used=148.00KiB
System, DUP: total=8.00MiB, used=16.00KiB
Metadata, DUP: total=32.00MiB, used=112.00KiB
GlobalReserve, single: total=3.25MiB, used=0.00B
</pre>

<p>
?含义
</p>
</div>
</li>

<li><a id="org3ff077e"></a>获取 dev list<br />
<div class="outline-text-5" id="text-1-2-3-9">
<p>
fun: cur<sub>devices</sub>
</p>

<p>
in: mount point
</p>

<p>
cmd: 	btrfs fi show mountpoint
</p>

<pre class="example">
Label: 'hello'  uuid: 28a933c4-6f53-4fc2-8418-edf68d3659e7
Total devices 1 FS bytes used 276.00KiB
devid    1 size 350.00MiB used 88.00MiB path /dev/loop0
</pre>


<p>
return: /dev/loop0
</p>
</div>
</li>

<li><a id="orgc31b0f7"></a>resize<br />
<div class="outline-text-5" id="text-1-2-3-10">
<p>
fun: resize<sub>pool</sub><sub>cmd</sub>
</p>

<p>
in: pool, dev<sub>list</sub><sub>byid</sub>, add=True
</p>

<p>
return: cmd, btrfs &lt;device list&gt; add(defauld)/delete root<sub>mnt</sub><sub>pt</sub>(pool)
</p>

<p>
cmd: btrfs device add &lt;dev-list&gt;
</p>

<p>
/dev/disk/by-id/{id}
</p>

<p>
detached- 开头的dev, 说明有missing
</p>
</div>
</li>

<li><a id="orge888a8f"></a>挂载pool<br />
<div class="outline-text-5" id="text-1-2-3-11">
<p>
fun: mount<sub>root</sub>
</p>

<p>
in: pool
</p>

<p>
return: mount point
</p>

<p>
默认挂载路径, <i>mnt2</i>
</p>

<p>
pool.mnt<sub>opiton</sub> 将会加入到mount 命令中的 -o 选项中, 包括 compress
</p>

<p>
存在两个 mount 变量, 当 default<sub>subvol</sub>().boot<sub>to</sub><sub>snap</sub>
</p>
<ul class="org-ul">
<li>True, subvol=/@</li>
<li>False,</li>
</ul>

<p>
先根据 /dev/disk/by-label/pool.name 进行mount 操作,
失败后 根据/dev/disk/by-id/pool.disk<sub>set.all</sub>() 进行, 
</p>

<p>
主要过程:
</p>
<ol class="org-ol">
<li>创建mount point dir</li>
<li>更改rw属性, chattr +i</li>
<li>获取dev by label, /dev/disk/by-label/{}</li>
<li>mount dev dir</li>
<li>增加opiton</li>
<li>dev scan</li>
<li>不能根据 label mount 时, 根据device id mount</li>
</ol>
</div>
</li>

<li><a id="org878351a"></a>卸载 mount point<br />
<div class="outline-text-5" id="text-1-2-3-12">
<p>
fun: umount<sub>root</sub>
</p>

<p>
in: mountpoint
</p>

<p>
cmd: umount -l mountpoint
</p>

<p>
-l, lazy unmount
</p>

<p>
获取mount状态(/proc/mount) 20 次(间隔 2秒),
当没有mount时, 更改rw属性为可读写, 删除dir
</p>
</div>
</li>

<li><a id="org3917350"></a>判定 subvolume  状态<br />
<div class="outline-text-5" id="text-1-2-3-13">
<p>
fun: is<sub>subvol</sub>
</p>

<p>
in: mountpoint
</p>

<p>
cmd: btrfs subvolume show mnt<sub>pt</sub>
</p>

<p>
cmd 结果 0, 返回True
</p>

<p>
return: True|False
</p>

<p>
true: 该 mount point 存在 subvolumn
</p>

<pre class="example">

/
	Name: 			&lt;FS_TREE&gt;
	UUID: 			07c27a72-f091-4481-9830-0334eb5b3ab4
	Parent UUID: 		-
	Received UUID: 		-
	Creation time: 		2022-07-07 19:19:51 +0800
	Subvolume ID: 		5
	Generation: 		19
	Gen at creation: 	0
	Parent ID: 		0
	Top level ID: 		0
	Flags: 			-
	Snapshot(s):

</pre>
</div>
</li>

<li><a id="org7ac08f6"></a>获取 subvolume 信息<br />
<div class="outline-text-5" id="text-1-2-3-14">
<p>
fun: subvol<sub>info</sub>
</p>

<p>
in: mountpoint
</p>

<p>
cmd: btrfs subvolume show mountpoint
</p>
</div>
</li>

<li><a id="org0212276"></a>增加share 目录<br />
<div class="outline-text-5" id="text-1-2-3-15">
<p>
share 即 subvolume
</p>

<p>
fun: add<sub>share</sub>
</p>

<p>
in: pool, sharename, qid
</p>

<p>
cmd: btrfs subvolume create -i 
</p>

<p>
share moutponint: /root<sub>mount</sub><sub>point</sub>/sharename
</p>

<p>
qid: 子卷配额组, qgroup<sub>create</sub>, <br />
   default, -1/-1 , 返回非-1/-1, 说明quota enabled <br />
   highest quota 2015/n
</p>

<pre class="example">
sudo btrfs qgroup show /mnt/btrfs/
qgroupid         rfer         excl 
--------         ----         ---- 
0/5         164.00KiB    164.00KiB 

</pre>


<p>
qgroupid: level/id
</p>

<p>
level 0 is reserved to the qgroups associated with subvolumes.
</p>

<p>
0/5 是 root subvolumn
</p>


<p>
btrfs show qgroup
	exclusively (excl)
	shared/referred to (rfer)
</p>

<p>
btrfs qgroup show -reF ./a
sudo  btrfs qgroup show -p ./a
</p>

<p>
exclusive:
  Exclusive of a qgroup conveys the useful information
  how much space will be freed in case all subvolumes of the qgroup get deleted
</p>


<p>
注:
<a href="https://btrfs.readthedocs.io/en/latest/btrfs-qgroup.html">https://btrfs.readthedocs.io/en/latest/btrfs-qgroup.html</a>
Qgroup is not stable yet and will impact performance in current
mainline kernel (v4.14).
</p>
</div>
</li>

<li><a id="org21fa345"></a>挂载共享目录<br />
<div class="outline-text-5" id="text-1-2-3-16">
<p>
fun: mount<sub>share</sub>
in: share, monut point
cmd: mount -t btrfs -o subvol<sub>str</sub>(subvolid=qgroup[2:]), pooldevice , mountpoint
</p>


<p>
fun: mount<sub>snap</sub>
in: share, snap<sub>name</sub>, snap<sub>qgroup</sub>, snap<sub>mnt</sub>
cmd: mount -t btrfs -o subvol<sub>str</sub>(subvolid=qgroup[2:]), pooldevice , mountpoint
</p>
</div>
</li>

<li><a id="org92d62a2"></a>默认 subvol<br />
<div class="outline-text-5" id="text-1-2-3-17">
<p>
cmd: btrfs subvol get-default /mnt/btrfs
</p>

<p>
由于 snapshot 和 rollback 后的qgroup, 还有subvol id 如何设置, 需要后面补充?
</p>
</div>
</li>

<li><a id="org7d0688b"></a>snapshot id<br />
<div class="outline-text-5" id="text-1-2-3-18">
<p>
cmd: btrfs subvol list -s pool<sub>mount</sub><sub>point</sub>
</p>
</div>
</li>


<li><a id="orgaf63e19"></a>share info<br />
<div class="outline-text-5" id="text-1-2-3-19">
<p>
cmd:
  btrfs subvol list -s mnt<sub>point</sub>,  snapshot id
  btrfs subvol list -p mnt<sub>point</sub>,  parent id
</p>

<p>
'/@',  snap vol ?
</p>
</div>

<ol class="org-ol">
<li><a id="org0021914"></a>share id<br />
<div class="outline-text-6" id="text-1-2-3-19-1">
<p>
fun: share<sub>id</sub>
</p>

<p>
in: pool, sharename
</p>

<p>
cmd: btrfs subvolume list root<sub>pool</sub><sub>mnt</sub>
</p>
</div>
</li>

<li><a id="org2dca73d"></a>remove<sub>share</sub><br />
<div class="outline-text-6" id="text-1-2-3-19-2">
<p>
fun: remove<sub>share</sub>
</p>

<p>
in: pool, sharename, pgroup, force=false
</p>

<p>
cmd: <br />
</p>
<ol class="org-ol">
<li>umount -l mountpoint,  (fun: umount<sub>root</sub>)</li>
<li>btrfs subvol list -o subvol<sub>mountpoint</sub></li>
<li>btrfs subvol delete subvol, 删除下面的 子volume</li>
<li>btrfs subvol delete subvol, 删除该mount point的volume</li>
<li>btrfs qgroup show mountpoint (fun: qgroup<sub>destroy</sub>), 查找 qgroup</li>
<li>btrfs qgroup destroy qid mountpoint, 删除 qgroup</li>
</ol>
</div>
</li>


<li><a id="org9789916"></a>qgroup<sub>destroy</sub><br />
<div class="outline-text-6" id="text-1-2-3-19-3">
<p>
fun: qgroup<sub>destroy</sub>
</p>

<p>
in: gid, mount<sub>point</sub>
</p>

<p>
cmd:
</p>
<ul class="org-ul">
<li>查找 btrfs qgroup show moutpoint</li>
<li>删除 btrfs qgroup destroy qid mountpoint</li>
</ul>
</div>
</li>
</ol>
</li>

<li><a id="org455fd6d"></a>snap<br />
<ol class="org-ol">
<li><a id="org61849c7"></a>获取 snap 详细信息<br />
<div class="outline-text-6" id="text-1-2-3-20-1">
<p>
fun: parse<sub>snap</sub><sub>details</sub>
</p>

<p>
in: pool mount point, snap path
</p>

<p>
return:
</p>
<ul class="org-ul">
<li>snapshot name or None , if snap is clone</li>
<li>writable</li>
<li>is<sub>clone</sub></li>
</ul>
</div>
</li>

<li><a id="org3e18348"></a>获取 snap 信息<br />
<div class="outline-text-6" id="text-1-2-3-20-2">
<p>
fun: snaps<sub>info</sub>
cmd: btrfs subvolume list -u -p -q mountpoint
return: snap dict
</p>

<pre class="example">

sudo btrfs subvol list -u -p -q .
ID 256 gen 42 parent 5 top level 5 parent_uuid -
	uuid a9d20f4c-555b-d746-92d0-21280852e009 path a
ID 257 gen 42 parent 5 top level 5 parent_uuid -
	uuid 41fe9e5f-c0dd-9941-875e-3d60fd880ef0 path b


</pre>
</div>
</li>



<li><a id="org401d057"></a>获取 property<br />
<div class="outline-text-6" id="text-1-2-3-20-3">
<p>
fun: get<sub>property</sub>
</p>

<p>
in:  mount point, property name
</p>

<p>
cmd: btrfs property get mnt<sub>pt</sub> prop<sub>name</sub> 
</p>

<p>
mount point: Vol(pool)/subvol(share/snap)
</p>

<p>
suppont property :
</p>
<ul class="org-ul">
<li>ro</li>
<li>compression</li>
<li>label</li>
</ul>

<pre class="example">
$ btrfs property get  .
   ro=false
   label=hello
</pre>
</div>
</li>


<li><a id="orgba7e892"></a>获取 snap<br />
<div class="outline-text-6" id="text-1-2-3-20-4">
<p>
fun: get<sub>snap</sub>, <br />
	 get<sub>oldest</sub><sub>snap</sub>, get<sub>lastest</sub><sub>snap</sub> 是上面函数的包装
</p>


<p>
in: subvol path, oldest, num<sub>retain</sub>, regex , test<sub>model</sub>
</p>

<p>
cmd: btrfs subvol list -o subvol<sub>path</sub>
</p>

<p>
-o 获取指定目录的 subvolumes,  但可能会被deprecated
参考:
<a href="https://www.mail-archive.com/linux-btrfs@vger.kernel.org/msg75514.html">https://www.mail-archive.com/linux-btrfs@vger.kernel.org/msg75514.html</a>
</p>
</div>
</li>
