operating_system/linux/btrfs.org
***** 删除 snap

	  fun: remove_snap

	  in: pool, share_name, snap_name, snap_qgroup

	  snap path:  pool_root_mount/.snapshots/share_name/snap_name

	  cmd : \\

		该 snap path 存在 subvolume ? 
		- btrfs subvolume delete snap_path
		- qgroup_desnroy(查找并删除qgroup)

		不存在
		- btrfs subvolume list -s root_mount
		- 模式匹配, ID.*{snap_name}$,  snap=root_mountpoint/id
		- btrfs subvolume delete snap
	
***** add snap

	  add_snap, add_clone 是对 add_snap_helper的包装
	 
****** snap helper
	  fun: add_snap_helper

	  in: orig_path, snap_path

	  cmd: btrfs subvolume snapshot orig_path snap

		当 clone 场景 : \\
	       从snapshot 克隆: orig_path = pool_root_mountpoint/.snapshots/share/ \\
		   其他:            orig_path = pool_root_mountpoint/share_path 

		当 add snap 场景:
	       orig_path = share_mountpoint
		   snap_path = share_mountpoint/.snapshots/share_subvol_name/snap_name

		  
**** scrub

***** scrub_start

	  fun: scrub_start

	  in: pool

	  ref: pool_scrub.py

	  cmd: btrfs scrub start -B mount_point

	     -B:  do not background and print scrub statistics when  finished
      注: 执行是开启新的进程进行

	  #+begin_src
		scrub done for 28a933c4-6f53-4fc2-8418-edf68d3659e7
		Scrub started:    Mon Jul 11 16:12:27 2022
		Status:           finished
		Duration:         0:00:00
		Total to scrub:   88.00MiB
		Rate:             0.00B/s
		Error summary:    csum=1
          Corrected:      0
          Uncorrectable:  1
          Unverified:     0
		ERROR: there are uncorrectable errors

	  #+end_src

***** scrub_status

	  fun: scrub_status

	  in: pool

	  cmd: btrfs scrub status -R mount_point
	 
	 
	  #+begin_src
         UUID:             28a933c4-6f53-4fc2-8418-edf68d3659e7
         Scrub started:    Mon Jul 11 16:12:27 2022
         Status:           finished
         Duration:         0:00:00
        	 data_extents_scrubbed: 8
        	 tree_extents_scrubbed: 22
        	 data_bytes_scrubbed: 163840
        	 tree_bytes_scrubbed: 360448
        	 read_errors: 0
        	 csum_errors: 1
        	 verify_errors: 0
        	 no_csum: 0
        	 csum_discards: 0
        	 super_errors: 0
        	 malloc_errors: 0
        	 uncorrectable_errors: 1
        	 unverified_errors: 0
        	 corrected_errors: 0
        	 last_physical: 105906176

	  #+end_src


**** resize

***** resize pool

	  fun: start_resize_pool

	  in: cmd

	  ref:
	     huey: 轻量级异步任务队列简介 \\
	     标记为 @task, 被huey 调用 async bypass function (start_resize_pool.call_local())

***** balance

	  fun: start_balance

	  in: mount_point, force=None, convert=None

	  cmd: btrfs balance start mount_point

	       force 时, 增加 -f 参数

		   dconvert mconvert, data 和 meta 的转换, 例如: \\
		      btrfs balance start -dconvert=raid5  /mydata \\
			  btrfs balance start -mconvert=raid5  /mydata \\

			  查看: btrfs filesystem filesystem mount_point


	  #+begin_src
         sudo dmesg |tail
		[712489.044636] BTRFS info (device loop0): relocating block group 30408704 flags metadata|dup
		[712489.069940] BTRFS info (device loop0): found 5 extents, stage: move data extents
		[712489.089790] BTRFS info (device loop0): relocating block group 22020096 flags system|dup
		[712489.105284] BTRFS info (device loop0): found 1 extents, stage: move data extents
		[712489.125579] BTRFS info (device loop0): relocating block group 13631488 flags data
		[712489.133105] BTRFS warning (device loop0): csum failed root -9 ino 259 off 77824 csum 0xad822372 expected csum 0x4082356f mirror 1
		[712489.133113] BTRFS error (device loop0): bdev /dev/loop0 errs: wr 0, rd 0, flush 0, corrupt 5, gen 0
		[712489.133426] BTRFS warning (device loop0): csum failed root -9 ino 259 off 77824 csum 0xad822372 expected csum 0x4082356f mirror 1
		[712489.133433] BTRFS error (device loop0): bdev /dev/loop0 errs: wr 0, rd 0, flush 0, corrupt 6, gen 0
		[712489.140867] BTRFS info (device loop0): balance: ended with status: -5
       
	  #+end_src

***** balance status

	  fun: balance_status

	  in: pool

	  cmd: btrfs balance status mount_point

	 
***** balance status internal

	  fun: balance_status_internal

	  in: pool

	  cmd: btrfs dev usage -b mount_point

	  快速获取状态的一个方法, 因为 balance 可能会持续很久?
	  如果 unallocated 的值 是个负, 表明 balance 可能还没做完.

	  #+begin_src
       $ sudo btrfs dev usage -b ./
       /dev/loop0, ID: 1
          Device size:           367001600
          Device slack:                  0
          Data,single:             8388608
          Metadata,DUP:          100663296
          System,DUP:             67108864
          Unallocated:           190840832
	  #+end_src

**** device scan

	 fun : device_scan

	 in: device list

	 cmd: btrfs device scan

	 #+begin_src
       $ sudo btrfs device scan /dev/loop0
       Scanning for btrfs filesystems on '/dev/loop0'
	 #+end_src
	 
**** btrfs uuid

	 fun: btrfs_uuid

	 cmd: btrfs filesystem show mount_point

	
