operating_system/linux/btrfs.html


<li><a id="orgbde2623"></a>删除 snap<br />
<div class="outline-text-6" id="text-1-2-3-20-5">
<p>
fun: remove<sub>snap</sub>
</p>

<p>
in: pool, share<sub>name</sub>, snap<sub>name</sub>, snap<sub>qgroup</sub>
</p>

<p>
snap path:  pool<sub>root</sub><sub>mount</sub>/.snapshots/share<sub>name</sub>/snap<sub>name</sub>
</p>

<p>
cmd : <br />
</p>

<p>
该 snap path 存在 subvolume ? 
</p>
<ul class="org-ul">
<li>btrfs subvolume delete snap<sub>path</sub></li>
<li>qgroup<sub>desnroy</sub>(查找并删除qgroup)</li>
</ul>

<p>
不存在
</p>
<ul class="org-ul">
<li>btrfs subvolume list -s root<sub>mount</sub></li>
<li>模式匹配, ID.*{snap<sub>name</sub>}$,  snap=root<sub>mountpoint</sub>/id</li>
<li>btrfs subvolume delete snap</li>
</ul>
</div>
</li>

<li><a id="org2d6c19d"></a>add snap<br />
<div class="outline-text-6" id="text-1-2-3-20-6">
<p>
add<sub>snap</sub>, add<sub>clone</sub> 是对 add<sub>snap</sub><sub>helper的包装</sub>
</p>
</div>

<ol class="org-ol">
<li><a id="org4c5afd5"></a>snap helper<br />
<div class="outline-text-7" id="text-1-2-3-20-6-1">
<p>
fun: add<sub>snap</sub><sub>helper</sub>
</p>

<p>
in: orig<sub>path</sub>, snap<sub>path</sub>
</p>

<p>
cmd: btrfs subvolume snapshot orig<sub>path</sub> snap
</p>

<p>
当 clone 场景 : <br />
   从snapshot 克隆: orig<sub>path</sub> = pool<sub>root</sub><sub>mountpoint</sub>/.snapshots/share/ <br />
   其他:            orig<sub>path</sub> = pool<sub>root</sub><sub>mountpoint</sub>/share<sub>path</sub> 
</p>

<p>
当 add snap 场景:
   orig<sub>path</sub> = share<sub>mountpoint</sub>
   snap<sub>path</sub> = share<sub>mountpoint</sub>/.snapshots/share<sub>subvol</sub><sub>name</sub>/snap<sub>name</sub>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="orgabdf9df"></a>scrub<br />
<ol class="org-ol">
<li><a id="org536f0aa"></a>scrub<sub>start</sub><br />
<div class="outline-text-6" id="text-1-2-3-21-1">
<p>
fun: scrub<sub>start</sub>
</p>

<p>
in: pool
</p>

<p>
ref: pool<sub>scrub.py</sub>
</p>

<p>
cmd: btrfs scrub start -B mount<sub>point</sub>
</p>

<p>
   -B:  do not background and print scrub statistics when  finished
注: 执行是开启新的进程进行
</p>

<pre class="example">
scrub done for 28a933c4-6f53-4fc2-8418-edf68d3659e7
Scrub started:    Mon Jul 11 16:12:27 2022
Status:           finished
Duration:         0:00:00
Total to scrub:   88.00MiB
Rate:             0.00B/s
Error summary:    csum=1
  Corrected:      0
  Uncorrectable:  1
  Unverified:     0
ERROR: there are uncorrectable errors

</pre>
</div>
</li>

<li><a id="org33f4197"></a>scrub<sub>status</sub><br />
<div class="outline-text-6" id="text-1-2-3-21-2">
<p>
fun: scrub<sub>status</sub>
</p>

<p>
in: pool
</p>

<p>
cmd: btrfs scrub status -R mount<sub>point</sub>
</p>


<pre class="example">
UUID:             28a933c4-6f53-4fc2-8418-edf68d3659e7
Scrub started:    Mon Jul 11 16:12:27 2022
Status:           finished
Duration:         0:00:00
	data_extents_scrubbed: 8
	tree_extents_scrubbed: 22
	data_bytes_scrubbed: 163840
	tree_bytes_scrubbed: 360448
	read_errors: 0
	csum_errors: 1
	verify_errors: 0
	no_csum: 0
	csum_discards: 0
	super_errors: 0
	malloc_errors: 0
	uncorrectable_errors: 1
	unverified_errors: 0
	corrected_errors: 0
	last_physical: 105906176

</pre>
</div>
</li>
</ol>
</li>


<li><a id="org3fa917a"></a>resize<br />
<ol class="org-ol">
<li><a id="org5f20353"></a>resize pool<br />
<div class="outline-text-6" id="text-1-2-3-22-1">
<p>
fun: start<sub>resize</sub><sub>pool</sub>
</p>

<p>
in: cmd
</p>

<p>
ref:
   huey: 轻量级异步任务队列简介 <br />
   标记为 @task, 被huey 调用 async bypass function (start<sub>resize</sub><sub>pool.call</sub><sub>local</sub>())
</p>
</div>
</li>

<li><a id="org9f79878"></a>balance<br />
<div class="outline-text-6" id="text-1-2-3-22-2">
<p>
fun: start<sub>balance</sub>
</p>

<p>
in: mount<sub>point</sub>, force=None, convert=None
</p>

<p>
cmd: btrfs balance start mount<sub>point</sub>
</p>

<p>
force 时, 增加 -f 参数
</p>

<p>
dconvert mconvert, data 和 meta 的转换, 例如: <br />
   btrfs balance start -dconvert=raid5  /mydata <br />
   btrfs balance start -mconvert=raid5  /mydata <br />
</p>

<p>
查看: btrfs filesystem filesystem mount<sub>point</sub>
</p>


<pre class="example">
 sudo dmesg |tail
[712489.044636] BTRFS info (device loop0): relocating block group 30408704 flags metadata|dup
[712489.069940] BTRFS info (device loop0): found 5 extents, stage: move data extents
[712489.089790] BTRFS info (device loop0): relocating block group 22020096 flags system|dup
[712489.105284] BTRFS info (device loop0): found 1 extents, stage: move data extents
[712489.125579] BTRFS info (device loop0): relocating block group 13631488 flags data
[712489.133105] BTRFS warning (device loop0): csum failed root -9 ino 259 off 77824 csum 0xad822372 expected csum 0x4082356f mirror 1
[712489.133113] BTRFS error (device loop0): bdev /dev/loop0 errs: wr 0, rd 0, flush 0, corrupt 5, gen 0
[712489.133426] BTRFS warning (device loop0): csum failed root -9 ino 259 off 77824 csum 0xad822372 expected csum 0x4082356f mirror 1
[712489.133433] BTRFS error (device loop0): bdev /dev/loop0 errs: wr 0, rd 0, flush 0, corrupt 6, gen 0
[712489.140867] BTRFS info (device loop0): balance: ended with status: -5

</pre>
</div>
</li>

<li><a id="org9e1c51d"></a>balance status<br />
<div class="outline-text-6" id="text-1-2-3-22-3">
<p>
fun: balance<sub>status</sub>
</p>

<p>
in: pool
</p>

<p>
cmd: btrfs balance status mount<sub>point</sub>
</p>
</div>
</li>


<li><a id="orgce7a568"></a>balance status internal<br />
<div class="outline-text-6" id="text-1-2-3-22-4">
<p>
fun: balance<sub>status</sub><sub>internal</sub>
</p>

<p>
in: pool
</p>

<p>
cmd: btrfs dev usage -b mount<sub>point</sub>
</p>

<p>
快速获取状态的一个方法, 因为 balance 可能会持续很久?
如果 unallocated 的值 是个负, 表明 balance 可能还没做完.
</p>

<pre class="example">
$ sudo btrfs dev usage -b ./
/dev/loop0, ID: 1
   Device size:           367001600
   Device slack:                  0
   Data,single:             8388608
   Metadata,DUP:          100663296
   System,DUP:             67108864
   Unallocated:           190840832
</pre>
</div>
</li>
</ol>
</li>

<li><a id="org1a90401"></a>device scan<br />
<div class="outline-text-5" id="text-1-2-3-23">
<p>
fun : device<sub>scan</sub>
</p>

<p>
in: device list
</p>

<p>
cmd: btrfs device scan
</p>

<pre class="example">
$ sudo btrfs device scan /dev/loop0
Scanning for btrfs filesystems on '/dev/loop0'
</pre>
</div>
</li>

<li><a id="org6ff4cd2"></a>btrfs uuid<br />
<div class="outline-text-5" id="text-1-2-3-24">
<p>
fun: btrfs<sub>uuid</sub>
</p>

<p>
cmd: btrfs filesystem show mount<sub>point</sub>
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: guo</p>
<p class="date">Created: 2022-07-11 Mon 20:48</p>
</div>
</body>
</html>
